INSERT INTO dbo.Departments (Name) VALUES
('Отдел искусства фотографии'),
('Отдел гравюры и рисунка'),
('Отдел искусства Античного мира'),
('Отдел искусства Древнего Востока'),
('Отдел искусства стран Европы XIX-XX вв.'),
('Отдел реставрации'),
('Отдел русского искусства XIX-XX вв.');

INSERT INTO dbo.Employees VALUES
('Иванов', 'Иван', 'Иванович', 'Реставратор', 30000, '20130109', NULL, 6),
('Петров', 'Петр', 'Петрович', 'Смотритель', 15000, '20130109', NULL, 1),
('Степанов', 'Степан', 'Степанович', 'Начальник', 50000, '20130109', NULL, 2),
('Федорова', 'Анна', 'Федоровна', 'Уборщица', 10000, '20130109', NULL, 3),
('Кузнецова', 'Наталья', 'Ивановна', 'Директор', 75000, '20130109', NULL, NULL),
('Потапов', 'Виктор', 'Сергеевич', 'Реставратор', 30000, '20130109', NULL, 5),
('Сергеев', 'Николай', 'Петрович', 'Экскурсовод', 30000, '20130109', NULL, 7),
('Коваленко', 'Мария', 'Владимировна', 'Экскурсовод', 30000, '20130109', NULL, 1),
('Верещагин', 'Вадим', 'Петрович', 'Экскурсовод', 30000, '20130109', NULL, 2),
('Сидорова', 'Татьяна', 'Викторовна', 'Экскурсовод', 30000, '20130109', NULL, 3),
('Семенова', 'Инна', 'Николаевна', 'Экскурсовод', 30000, '20130109', NULL, 4);

INSERT INTO dbo.Authors VALUES
('Rikelme','Claudio',NULL,'1933-7-7','2006-7-24',032),
('Alice','Antonio',NULL,'1886-2-23','1943-8-24',032),
('Shorin','Dmitry','Alexandrovich','1971-4-28',NULL,643),
(N'Михайлов',N'Вячеслав',N'Саввич','1945-9-7',NULL,643),
(N'Ветрогонский',N'Андрей',N'Владимирович','1956-4-1',NULL,643),
('Larravide','Manuel',NULL,'1871-10-22','1910-5-22',858),
(N'Sívori','Eduardo',NULL,'1847-10-13','1918-6-5',032),
(N'ФЕДОРОВА',N'МАРИНА',N'ВЛАДИМИРОВНА','1981',null,643),
(N'Франсиско',N'Инфанте',N'Ара́на','1943-6-4',null,643),
('Martorell',N'María',null,'1909-1-18','2010-7-26',032);

INSERT INTO dbo.Artworks VALUES
(N'Планы на май',N'Реализм',N'масло',3,'2020','19800','2'),
('Mizal',N'Реализм',N'масло',1,'2000','64830','2'),
('Desde mi ventana',N'Реализм',N'масло',2,'1937','726377',2),
('L. Bare de Pagano e Hijo',N'Реализм',N'масло',2,'1935','364707','2'),
(N'Белая ночь на Фонтанке',N'Абстракционизм',N'акрил',4,'2002','880000','2'),
(N'Штрих-код',N'Экспрессионизм',N'смешанная техника',5,'2014','210000','2'),
('Bohemio',N'Реализм',N'масло',7,NULL,'1364964','2'),
('Space Laundry',N'Поп-арт',N'масло',8,'2019','160000','2'),
(N'Ladera montañosa',N'Реализм',N'масло',7,'1905','325360','2'),
(N'Артефакты.',N'Фотография',N'Фотография',9,'1977','125000','1');

INSERT INTO dbo.Orders VALUES
('3','anon','1'),
('10','user1','1'),
('8','user2','1'),
('3','anon','1'),
('5','user1','1'),
('3','anon','1'),
('10','user3','1'),
('9','user4','1'),
('3','user5','1'),
('5','anon','1');

